---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.GradientNoiseType.Regular
enum: Autodesk.Revit.DB.Visual.GradientNoiseType
source: html/e0e03f6e-f8bf-4181-d5ec-2472de01bda1.htm
---
# Autodesk.Revit.DB.Visual.GradientNoiseType.Regular